One Hot Encoding >> Convert categorical Data In to Numerical (0,1) Formate

In [1]:
# import library
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 
warnings.filterwarnings('ignore')

In [4]:
# import data
dataset = pd.read_csv('Loan.csv')
dataset.head(5)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [8]:
dataset.shape

(614, 13)

In [12]:
dataset.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [33]:
# Now fill the missing values in gender  
dataset['Gender'].fillna(dataset['Gender'].mode()[0],inplace = True)

In [32]:
# Now fill the missing values in male 
dataset['Married'].fillna(dataset['Married'].mode()[0],inplace = True)

In [46]:
dataset.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [52]:
# extract data jisme humko encoding karna hai 
en_data = dataset[['Gender','Married']]
en_data

     Gender Married
0      Male      No
1      Male     Yes
2      Male     Yes
3      Male     Yes
4      Male      No
..      ...     ...
609  Female      No
610    Male     Yes
611    Male     Yes
612    Male     Yes
613  Female      No

[614 rows x 2 columns]

### get_dummies

One Hot Encoding done with the two methoda 
1 (Get.dummies)
2 (scikit learn one hot encoder)

In [69]:
dummies = pd.get_dummies(en_data).head()
dummies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Gender_Female  5 non-null      bool
 1   Gender_Male    5 non-null      bool
 2   Married_No     5 non-null      bool
 3   Married_Yes    5 non-null      bool
dtypes: bool(4)
memory usage: 152.0 bytes

Isse hum data ko encode to kar sakte hai par after encode humko data ke datatype ko change karna padta hai this to complecated
iske liye after this step hum sklearn ka use karenge to convert in to numerical

### One Hot Encoding

In [58]:
from sklearn.preprocessing import OneHotEncoder

In [83]:
encoder = OneHotEncoder(drop='first')
en = encoder.fit_transform(en_data).toarray()
en

array([[1., 0.],
       [1., 1.],
       [1., 1.],
       ...,
       [1., 1.],
       [1., 1.],
       [0., 0.]], shape=(614, 2))

In [84]:
data1 = pd.DataFrame(en,columns = ['Gender_Male','Married_Yes'])
data1

     Gender_Male  Married_Yes
0            1.0          0.0
1            1.0          1.0
2            1.0          1.0
3            1.0          1.0
4            1.0          0.0
..           ...          ...
609          0.0          0.0
610          1.0          1.0
611          1.0          1.0
612          1.0          1.0
613          0.0          0.0

[614 rows x 2 columns]